In [1]:
import pandas as pd
import numpy as np

In [33]:
#https://www.kaggle.com/harturo123/online-adds-of-used-cars

In [2]:
cars = pd.read_csv('./data.csv', sep=';')
cars.head()

,ID,make,model,version,months_old,power,sale_type,num_owners,gear_type,fuel_type,kms,price
0,97860,Porsche,911,Carrera 4 S Coup�,240.0,210.0,classic,3.0,manual,gasoline,202000.0,999999
1,27821,Ford,Mustang,Gt500 Cabrio Vendido,54.0,487.0,used,1.0,manual,gasoline,30000.0,685000
2,97801,Porsche,911,3.3 Turbo Targa (Precio A Consultar),358.0,220.0,used,NaN,manual,gasoline,56300.0,555555
3,98251,Porsche,911,R Unidad 343 De 991-Iva Deducible,14.0,368.0,used,1.0,manual,gasoline,2800.0,470000
4,98250,Porsche,911,Gt2 Rs,3.0,515.0,used,NaN,NaN,gasoline,10.0,450000

In [3]:
before = len(cars)
cars1 = cars.drop_duplicates()
after = len(cars1)
print('Number of duplicate records dropped: ', str(before - after))

Number of duplicate records dropped:  0

In [4]:
cars1 = cars[['make', 'model', 'months_old', 'power','gear_type','fuel_type','kms','price']]
cars1.head()

      make    model  months_old  power gear_type fuel_type       kms   price
0  Porsche      911       240.0  210.0    manual  gasoline  202000.0  999999
1     Ford  Mustang        54.0  487.0    manual  gasoline   30000.0  685000
2  Porsche      911       358.0  220.0    manual  gasoline   56300.0  555555
3  Porsche      911        14.0  368.0    manual  gasoline    2800.0  470000
4  Porsche      911         3.0  515.0       NaN  gasoline      10.0  450000

In [5]:
cars1['old_years'] = cars1['months_old'].divide(12).round()
cars1.head()

C:\Users\rafae\Anaconda3\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,make,model,months_old,power,gear_type,fuel_type,kms,price,old_years
0,Porsche,911,240.0,210.0,manual,gasoline,202000.0,999999,20.0
1,Ford,Mustang,54.0,487.0,manual,gasoline,30000.0,685000,4.0
2,Porsche,911,358.0,220.0,manual,gasoline,56300.0,555555,30.0
3,Porsche,911,14.0,368.0,manual,gasoline,2800.0,470000,1.0
4,Porsche,911,3.0,515.0,NaN,gasoline,10.0,450000,0.0

In [6]:
cars1 = cars1[['make', 'model', 'power','gear_type','fuel_type','kms','old_years','price']]
cars1.head()

      make    model  power gear_type fuel_type       kms  old_years   price
0  Porsche      911  210.0    manual  gasoline  202000.0       20.0  999999
1     Ford  Mustang  487.0    manual  gasoline   30000.0        4.0  685000
2  Porsche      911  220.0    manual  gasoline   56300.0       30.0  555555
3  Porsche      911  368.0    manual  gasoline    2800.0        1.0  470000
4  Porsche      911  515.0       NaN  gasoline      10.0        0.0  450000

In [7]:
print(set(cars1['make']))

{'Citroen', 'Chrysler', 'Alfa', 'Ds', 'Mitsubishi', 'Ssangyong', 'Skoda', 'Jaguar', 'Peugeot', 'Honda', 'Mini', 'Chevrolet', 'Land', 'Porsche', 'Iveco', 'Volkswagen', 'Bmw', 'Audi', 'Hyundai', 'Volvo', 'Fiat', 'Smart', 'Ford', 'Bentley', 'Seat', 'Toyota', 'Mercedes-Benz', 'Nissan', 'Jeep', 'Mazda', 'Dacia', 'Renault', 'Saab', 'Suzuki', 'Kia', 'Opel'}

In [8]:
print(set(cars1['model']))

{'407', 'Espace', 'I30', 'AlteaXl', 'Jumpy', 'Astra', 'Captiva', '508', '206', 'AutomobilesDs4', '500', 'Forfour', 'E220', 'Verso', 'Ml320', 'A4', 'Ml350', 'Carens', 'Aveo', '325', '320', 'Trafic', 'V220', 'Sprinter', 'I10', 'Toledo', 'Ix20', 'Rapid/Spaceback', 'Mokka', 'RoverRangeRoverSport', 'Qashqai', 'C4Picasso', 'A1', 'Q3', 'C5', 'Xc90', 'Touran', 'Doblo', 'C3Picasso', 'Berlingo', 'Voyager', 'Tiguan', 'Polo', 'Scenic', 'Outlander', '2008', 'Fortwo', 'Asx', 'Micra', 'B200', 'Auris', 'Ducato', 'Antara', 'Laguna', 'Continental', 'Daily', 'E320', 'Xe', 'Vivaro', 'V40Cc', 'Ecosport', 'GrandC-Max', 'Viano', '520', 'C220', '500C', 'Xc60', 'Ka/Ka+', 'T5Multivan', 'GolfVariant', 'Transporter', 'Pulsar', 'Spacetourer', 'Bipper', 'Fiorino', 'GrandScenic', 'C-Max', 'Civic', '120', 'Exeo', 'E350', 'Tucson', 'S40', 'Wrangler', 'Montero', '218', 'A180', 'B180', 'I20', '640', 'SantaFe', 'Twingo', 'Panda', 'V40', 'Cla200', 'Altea', '9-3', 'Cr-V', '530', 'RoverDefender', 'Cordoba', 'Insignia', 'S-Max', 'Yaris', 'B-Max', 'Xsara', '420', 'Fabia', '500X', 'Passat', 'Juke', 'Captur', 'Mustang', 'Q2', 'RomeoMito', 'Xf', 'Cla220', 'Cayenne', '316', 'C3', 'Accord', '5008', 'Octavia', 'Kuga', 'Aygo', 'A8', 'Renegade', 'GrandVoyager', 'S60', 'Transit', '500L', 'Adam', 'CooperD', 'Kangoo', 'Cx-5', 'Vito', '3008', 'Sportage', 'Rav4', 'Cc', 'C2', 'V60', 'Partner', 'Picanto', 'Focus', 'Sharan', 'Cls350', 'Zafira', '118', 'Macan', 'GolfGti', 'Leon', 'GrandCherokee', 'C3Aircross', 'Superb', 'Combo', '216', 'AutomobilesDs3', 'X-Trail', 'X5', 'Q5', 'Ix35', 'Vectra', '308', 'XsaraPicasso', 'Golf', "Cee'D", 'Punto', 'X3', '911', 'LandCruiser', 'Meriva', 'Cruze', '307', 'C200', 'Gla200', 'Qashqai+2', 'GrandVitara', 'RomeoGiulietta', 'Rodius', 'Boxster', '730', 'X1', 'A6', '208', 'Note', 'RoverRangeRover', 'X4', 'Caddy', 'Touareg', 'RoverDiscovery', 'Citan', 'PassatVariant', 'A200', 'Kadjar', 'C4Cactus', 'Tipo', 'Panamera', 'Duster', 'Talisman', 'Compass', 'RoverFreelander', 'Z4', 'Tt', 'ZafiraTourer', 'C-Elys�e', '207', '3', 'Clio', 'Beetle', 'Rexton', 'Ateca', 'GolfSportsvan', 'A5', 'C4', 'Cooper', '6', '220', 'Mondeo', 'Rio', '330', 'Scirocco', 'A7', 'Ibiza', 'Jumper', 'RoverRangeRoverEvoque', 'A4Allroad', 'Q7', 'Corsa', 'Sandero', 'Slk200', 'Alhambra', 'X6', 'Fiesta', 'I40', 'A3', '116', 'Eos', '318', 'Carnival', 'AutomobilesDs5', 'GrandC4Picasso', 'TransitConnect', 'Expert', 'Megane', 'Avensis', '525'}

In [9]:
cars1['model'] = cars1['model'].str.replace('C-Elys�e', 'C-Elys')
print(set(cars1['model']))

{'407', 'Espace', 'I30', 'AlteaXl', 'Jumpy', 'Astra', 'Captiva', '508', '206', 'AutomobilesDs4', '500', 'Forfour', 'E220', 'Verso', 'Ml320', 'A4', 'Ml350', 'Carens', 'Aveo', '325', '320', 'Trafic', 'V220', 'Sprinter', 'I10', 'Toledo', 'Ix20', 'Rapid/Spaceback', 'Mokka', 'RoverRangeRoverSport', 'Qashqai', 'C4Picasso', 'A1', 'Q3', 'C5', 'Xc90', 'Touran', 'Doblo', 'C3Picasso', 'Berlingo', 'Voyager', 'Tiguan', 'Polo', 'Scenic', 'Outlander', '2008', 'Fortwo', 'Asx', 'Micra', 'B200', 'Auris', 'Ducato', 'Antara', 'Laguna', 'Continental', 'Daily', 'E320', 'Xe', 'Vivaro', 'V40Cc', 'Ecosport', 'GrandC-Max', 'Viano', '520', 'C220', '500C', 'Xc60', 'Ka/Ka+', 'T5Multivan', 'GolfVariant', 'Transporter', 'Pulsar', 'Spacetourer', 'Bipper', 'Fiorino', 'GrandScenic', 'C-Max', 'Civic', '120', 'Exeo', 'E350', 'Tucson', 'S40', 'Wrangler', 'Montero', '218', 'A180', 'B180', 'I20', '640', 'SantaFe', 'Twingo', 'Panda', 'V40', 'Cla200', 'Altea', '9-3', 'Cr-V', '530', 'RoverDefender', 'Cordoba', 'Insignia', 'S-Max', 'Yaris', 'B-Max', 'Xsara', '420', 'Fabia', '500X', 'Passat', 'Juke', 'Captur', 'Mustang', 'Q2', 'RomeoMito', 'Xf', 'Cla220', 'Cayenne', '316', 'C3', 'Accord', '5008', 'Octavia', 'Kuga', 'Aygo', 'A8', 'Renegade', 'GrandVoyager', 'S60', 'Transit', '500L', 'Adam', 'CooperD', 'Kangoo', 'Cx-5', 'Vito', '3008', 'Sportage', 'Rav4', 'Cc', 'C2', 'V60', 'Partner', 'Picanto', 'Focus', 'Sharan', 'Cls350', 'Zafira', '118', 'Macan', 'GolfGti', 'Leon', 'GrandCherokee', 'C3Aircross', 'Superb', 'Combo', '216', 'AutomobilesDs3', 'X-Trail', 'X5', 'Q5', 'Ix35', 'Vectra', '308', 'XsaraPicasso', 'Golf', "Cee'D", 'Punto', 'X3', '911', 'LandCruiser', 'Meriva', 'Cruze', '307', 'C200', 'Gla200', 'Qashqai+2', 'GrandVitara', 'RomeoGiulietta', 'Rodius', 'Boxster', '730', 'X1', 'A6', '208', 'Note', 'RoverRangeRover', 'X4', 'Caddy', 'Touareg', 'C-Elys', 'RoverDiscovery', 'Citan', 'PassatVariant', 'A200', 'Kadjar', 'C4Cactus', 'Tipo', 'Panamera', 'Duster', 'Talisman', 'Compass', 'RoverFreelander', 'Z4', 'Tt', 'ZafiraTourer', '207', '3', 'Clio', 'Beetle', 'Rexton', 'Ateca', 'GolfSportsvan', 'A5', 'C4', 'Cooper', '6', '220', 'Mondeo', 'Rio', '330', 'Scirocco', 'A7', 'Ibiza', 'Jumper', 'RoverRangeRoverEvoque', 'A4Allroad', 'Q7', 'Corsa', 'Sandero', 'Slk200', 'Alhambra', 'X6', 'Fiesta', 'I40', 'A3', '116', 'Eos', '318', 'Carnival', 'AutomobilesDs5', 'GrandC4Picasso', 'TransitConnect', 'Expert', 'Megane', 'Avensis', '525'}

In [10]:
cars1.head()

      make    model  power gear_type fuel_type       kms  old_years   price
0  Porsche      911  210.0    manual  gasoline  202000.0       20.0  999999
1     Ford  Mustang  487.0    manual  gasoline   30000.0        4.0  685000
2  Porsche      911  220.0    manual  gasoline   56300.0       30.0  555555
3  Porsche      911  368.0    manual  gasoline    2800.0        1.0  470000
4  Porsche      911  515.0       NaN  gasoline      10.0        0.0  450000

In [11]:
import json
import requests

In [12]:
response = requests.get('https://parallelum.com.br/fipe/api/v1/carros/marcas')
results = response.json()
results

[{'nome': 'Acura', 'codigo': '1'},
 {'nome': 'Agrale', 'codigo': '2'},
 {'nome': 'Alfa Romeo', 'codigo': '3'},
 {'nome': 'AM Gen', 'codigo': '4'},
 {'nome': 'Asia Motors', 'codigo': '5'},
 {'nome': 'ASTON MARTIN', 'codigo': '189'},
 {'nome': 'Audi', 'codigo': '6'},
 {'nome': 'Baby', 'codigo': '207'},
 {'nome': 'BMW', 'codigo': '7'},
 {'nome': 'BRM', 'codigo': '8'},
 {'nome': 'Bugre', 'codigo': '123'},
 {'nome': 'Cadillac', 'codigo': '10'},
 {'nome': 'CBT Jipe', 'codigo': '11'},
 {'nome': 'CHANA', 'codigo': '136'},
 {'nome': 'CHANGAN', 'codigo': '182'},
 {'nome': 'CHERY', 'codigo': '161'},
 {'nome': 'Chrysler', 'codigo': '12'},
 {'nome': 'Citroën', 'codigo': '13'},
 {'nome': 'Cross Lander', 'codigo': '14'},
 {'nome': 'Daewoo', 'codigo': '15'},
 {'nome': 'Daihatsu', 'codigo': '16'},
 {'nome': 'Dodge', 'codigo': '17'},
 {'nome': 'EFFA', 'codigo': '147'},
 {'nome': 'Engesa', 'codigo': '18'},
 {'nome': 'Envemo', 'codigo': '19'},
 {'nome': 'Ferrari', 'codigo': '20'},
 {'nome': 'Fiat', 'codigo': '21'},
 {'nome': 'Fibravan', 'codigo': '149'},
 {'nome': 'Ford', 'codigo': '22'},
 {'nome': 'FOTON', 'codigo': '190'},
 {'nome': 'Fyber', 'codigo': '170'},
 {'nome': 'GEELY', 'codigo': '199'},
 {'nome': 'GM - Chevrolet', 'codigo': '23'},
 {'nome': 'GREAT WALL', 'codigo': '153'},
 {'nome': 'Gurgel', 'codigo': '24'},
 {'nome': 'HAFEI', 'codigo': '152'},
 {'nome': 'Honda', 'codigo': '25'},
 {'nome': 'Hyundai', 'codigo': '26'},
 {'nome': 'Isuzu', 'codigo': '27'},
 {'nome': 'IVECO', 'codigo': '208'},
 {'nome': 'JAC', 'codigo': '177'},
 {'nome': 'Jaguar', 'codigo': '28'},
 {'nome': 'Jeep', 'codigo': '29'},
 {'nome': 'JINBEI', 'codigo': '154'},
 {'nome': 'JPX', 'codigo': '30'},
 {'nome': 'Kia Motors', 'codigo': '31'},
 {'nome': 'Lada', 'codigo': '32'},
 {'nome': 'LAMBORGHINI', 'codigo': '171'},
 {'nome': 'Land Rover', 'codigo': '33'},
 {'nome': 'Lexus', 'codigo': '34'},
 {'nome': 'LIFAN', 'codigo': '168'},
 {'nome': 'LOBINI', 'codigo': '127'},
 {'nome': 'Lotus', 'codigo': '35'},
 {'nome': 'Mahindra', 'codigo': '140'},
 {'nome': 'Maserati', 'codigo': '36'},
 {'nome': 'Matra', 'codigo': '37'},
 {'nome': 'Mazda', 'codigo': '38'},
 {'nome': 'Mclaren', 'codigo': '211'},
 {'nome': 'Mercedes-Benz', 'codigo': '39'},
 {'nome': 'Mercury', 'codigo': '40'},
 {'nome': 'MG', 'codigo': '167'},
 {'nome': 'MINI', 'codigo': '156'},
 {'nome': 'Mitsubishi', 'codigo': '41'},
 {'nome': 'Miura', 'codigo': '42'},
 {'nome': 'Nissan', 'codigo': '43'},
 {'nome': 'Peugeot', 'codigo': '44'},
 {'nome': 'Plymouth', 'codigo': '45'},
 {'nome': 'Pontiac', 'codigo': '46'},
 {'nome': 'Porsche', 'codigo': '47'},
 {'nome': 'RAM', 'codigo': '185'},
 {'nome': 'RELY', 'codigo': '186'},
 {'nome': 'Renault', 'codigo': '48'},
 {'nome': 'Rolls-Royce', 'codigo': '195'},
 {'nome': 'Rover', 'codigo': '49'},
 {'nome': 'Saab', 'codigo': '50'},
 {'nome': 'Saturn', 'codigo': '51'},
 {'nome': 'Seat', 'codigo': '52'},
 {'nome': 'SHINERAY', 'codigo': '183'},
 {'nome': 'smart', 'codigo': '157'},
 {'nome': 'SSANGYONG', 'codigo': '125'},
 {'nome': 'Subaru', 'codigo': '54'},
 {'nome': 'Suzuki', 'codigo': '55'},
 {'nome': 'TAC', 'codigo': '165'},
 {'nome': 'Toyota', 'codigo': '56'},
 {'nome': 'Troller', 'codigo': '57'},
 {'nome': 'Volvo', 'codigo': '58'},
 {'nome': 'VW - VolksWagen', 'codigo': '59'},
 {'nome': 'Wake', 'codigo': '163'},
 {'nome': 'Walk', 'codigo': '120'}]

In [13]:
datacars = pd.DataFrame(results)
datacars.head()

  codigo         nome
0      1        Acura
1      2       Agrale
2      3   Alfa Romeo
3      4       AM Gen
4      5  Asia Motors

In [14]:
datacars.rename(columns={'nome': 'make'}, inplace=True)
datacars['make'] = datacars['make'].str.replace('Alfa Romeo', 'Alfa')
datacars.head()

  codigo         make
0      1        Acura
1      2       Agrale
2      3         Alfa
3      4       AM Gen
4      5  Asia Motors

In [15]:
s1 = pd.merge(cars1,datacars,how='left', on=['make'])
s1.head()

,make,model,power,gear_type,fuel_type,kms,old_years,price,codigo
0,Porsche,911,210.0,manual,gasoline,202000.0,20.0,999999,47
1,Ford,Mustang,487.0,manual,gasoline,30000.0,4.0,685000,22
2,Porsche,911,220.0,manual,gasoline,56300.0,30.0,555555,47
3,Porsche,911,368.0,manual,gasoline,2800.0,1.0,470000,47
4,Porsche,911,515.0,NaN,gasoline,10.0,0.0,450000,47

In [16]:
table = pd.pivot_table(s1, index=['make','codigo','model'],
                       aggfunc={'model':[len],'power': np.mean, 'kms':np.mean, 'old_years':np.mean,
                                'price':np.mean}).round()
table.head()

                                 kms model old_years  power    price
                                mean   len      mean   mean     mean
make codigo model
Alfa 3      RomeoGiulietta   55684.0   291       3.0   92.0  13943.0
            RomeoMito        67039.0   132       6.0   76.0   9185.0
Audi 6      A1               37728.0   968       3.0   75.0  15536.0
            A3               87223.0  2091       5.0   92.0  16259.0
            A4              102455.0  2115       6.0  113.0  18778.0

In [17]:
table1 = table[['model','kms','power','old_years','price']]
table1.head()

                           model       kms  power old_years    price
                             len      mean   mean      mean     mean
make codigo model
Alfa 3      RomeoGiulietta   291   55684.0   92.0       3.0  13943.0
            RomeoMito        132   67039.0   76.0       6.0   9185.0
Audi 6      A1               968   37728.0   75.0       3.0  15536.0
            A3              2091   87223.0   92.0       5.0  16259.0
            A4              2115  102455.0  113.0       6.0  18778.0